[{
  "profileName": "Natalia Carrillo",
  "rating": 5,
  "reviewId": "R331717BT20JEI",
  "reviewDate": "2025-12-18",
  "reviewTitle": "Best collagen mask",
  "reviewText": "I loved this collagen mask! My skin felt instantly more hydrated, plump, and smooth after just one use. It gave me a healthy glow without feeling sticky or heavy. I loved it so much that I got more to give as Christmas presents to my friends"
},
{
  "profileName": "Melissa J L",
  "rating": 5,
  "reviewId": "R27N46COQQB8Y4",
  "reviewDate": "2025-12-16",
  "reviewTitle": "Hydrating collagen mask",
  "reviewText": "These masks are nice and easy to use. This comes as a 4 pack amd each pack as a top and bottom mask to cover your whole face. Upon opening a pack. The mask is covered in serum making it a little slippery, but once I got both pieces on my face it stayed in place well. The... These masks are nice and easy to use. This comes as a 4 pack amd each pack as a top and bottom mask to cover your whole face. Upon opening a pack. The mask is covered in serum making it a little slippery, but once I got both pieces on my face it stayed in place well. The masks gave an almost cooling effect which felt refreshing. I wore this for 3-4 hours until the mask turned clear as I touched. When I removed the mask my face felt soft and moisturized. This is a great addition to my at home spa days"
},
{
  "profileName": "Pitkinchick",
  "rating": 5,
  "reviewId": "R3RX1H40PF6A1I",
  "reviewDate": "2025-12-12",
  "reviewTitle": "Spa-like Facial!",
  "reviewText": "I love this mask! It is enriched with bio-collagen and hydrogel technology to hydrate your skin. I have very sensitive skin. I was cautious about putting on this mask because of my sensitivity but this mask is made for all skin types. I tried the mask and it left my face... I love this mask! It is enriched with bio-collagen and hydrogel technology to hydrate your skin.  I have very sensitive skin.  I was cautious about putting on this mask because of my sensitivity but this mask is made for all skin types.  I tried the mask and it left my face feeling soft and radiant.  The mask supports natural collagen production which improves elasticity and firmness.  You can feel the hydration and see the glow from the mask's effects.  This mask is like getting a spa treatment right at home."
},
{
  "profileName": "GO DAWGS",
  "rating": 5,
  "reviewId": "R30RDDJDR3V347",
  "reviewDate": "2025-12-08",
  "reviewTitle": "Deeply Hydrating & Refreshing, A Must Have Face Mask!",
  "reviewText": "I absolutely love this Hydrating Bio Collagen Deep Mask! The mask starts out white and gradually turns clear as it works its magic. I usually wear masks overnight, but I tried this one during the day for about four hours, and my skin felt incredibly hydrated and refreshed.... I absolutely love this Hydrating Bio Collagen Deep Mask! The mask starts out white and gradually turns clear as it works its magic. I usually wear masks overnight, but I tried this one during the day for about four hours, and my skin felt incredibly hydrated and refreshed. It leaves a glossy, plump feeling without any heaviness, and the hydrogel fits comfortably for a spa like experience at home. The formula is gentle, great for most skin types, and the price is excellent. Arrived quickly and makes a perfect gift or stocking stuffer. Truly a must have for glowing, revitalized skin!"
},
{
  "profileName": "Shaina",
  "rating": 5,
  "reviewId": "RJHLLN0EG9PCF",
  "reviewDate": "2025-12-17",
  "reviewTitle": "Hydrating/skin plumping/reduces the appearance of lines",
  "reviewText": "You get 4 collagen face masks when you order. They are made of gel and they come with a top half mask, a bottom half mask, a lip mask piece and eye mask pieces. They are slippery too so you just have to be careful when you take them out. I used a couple of these... You get 4 collagen face masks when you order. They are made of gel and they come with a top half mask, a bottom half mask, a lip mask piece and eye mask pieces. They are slippery too so you just have to be careful when you take them out. I used a couple of these masks already. I noticed that they added a lot of hydration & they also plumped my skin. The extra hydration reduced the appearance of some of my finer lines. The winter season hasn’t been kind to my skin but these masks are helping!! Overall, these face mask really seem to be making a different. I recommend these masks if you have really dry skin or mature skin."
},
{
  "profileName": "CSReviews",
  "rating": 5,
  "reviewId": "REPJ7TTCVPWC0",
  "reviewDate": "2025-12-12",
  "reviewTitle": "Hydrating Bio-Collagen Deep Masks",
  "reviewText": "These Hydrating Bio-Collagen Deep Masks are excellent quality. This was my first time using a two-piece mask and I never want to go back to the single sheet masks. You get a more customized fit with the two-piece mask. The mask itself feels very cooling and moisturizing.... These Hydrating Bio-Collagen Deep Masks are excellent quality. This was my first time using a two-piece mask and I never want to go back to the single sheet masks.  You get a more customized fit with the two-piece mask.  The mask itself feels very cooling and moisturizing.  It’s like a luxurious spa-like experience. This set of four masks is definitely a good value for the price."
},
{
  "profileName": "Helpfulvoice",
  "rating": 5,
  "reviewId": "R1HTVTXPE1ONZ6",
  "reviewDate": "2025-12-10",
  "reviewTitle": "Helped calm my skin",
  "reviewText": "It has a cool hydrogel texture that feels soothing right away, and it’s comfortable enough to leave on overnight. I noticed my skin felt more refreshed and softer in the morning. It also helped calm my skin and made my pores look a little smoother. Overall, it’s a nice mask... It has a cool hydrogel texture that feels soothing right away, and it’s comfortable enough to leave on overnight. I noticed my skin felt more refreshed and softer in the morning. It also helped calm my skin and made my pores look a little smoother. Overall, it’s a nice mask if you want something gentle, hydrating, and easy to use."
},
{
  "profileName": "John Ruiz",
  "rating": 5,
  "reviewId": "RZJYLPMLSULB2",
  "reviewDate": "2025-11-25",
  "reviewTitle": "The mask has a great feel on the skin and delivers excellent results",
  "reviewText": "I’m really impressed with this product! The mask has a great feel on the skin and delivers excellent results. After using it, my skin feels smoother, more hydrated, and refreshed. I would definitely recommend this to anyone looking for a quality collagen mask"
},
{
  "profileName": "Juliana Roldan",
  "rating": 5,
  "reviewId": "R2L2W94Y29RBNT",
  "reviewDate": "2025-11-25",
  "reviewTitle": "Great mask",
  "reviewText": "Great mask! It hydrates deeply and makes my skin feel soft and refreshed. I’ve noticed my skin looks brighter and more supple after each use."
},
{
  "profileName": "Amazon Customer",
  "rating": 5,
  "reviewId": "R21ADHKN0ZNGG8",
  "reviewDate": "2025-11-25",
  "reviewTitle": "Very good mask",
  "reviewText": "Really nice mask, very refreshing. Left my skin glowing and at very good deal"
}]